In [ ]:
""" Basic Metrics with Pandas Practice 

adapted from https://github.com/rlowd/python-bigdata/blob/master/intro2stats/
notebooks/4.%20Basic%20Metrics.py3.ipynb"""

In [2]:
import numpy as np
import pandas as pd
from datetime import datetime as dt
from scipy import stats

Read in the three datasets listed in the assignment

In [3]:
#Price by state and date 
    ##set parse_dates = to -1 so that they are read in from the datetime library as a datetime64 data type, which is easier to work with
price = pd.read_csv("https://raw.githubusercontent.com/rlowd/python-bigdata/master/intro2stats/data/Weed_Price.csv", 
                        parse_dates=[-1])

#Demographics of State
demographics = pd.read_csv("https://raw.githubusercontent.com/rlowd/python-bigdata/master/intro2stats/data/Demographics_State.csv")

#Population of State
population = pd.read_csv("https://raw.githubusercontent.com/rlowd/python-bigdata/master/intro2stats/data/Population_State.csv")

In [4]:
price.head()

        State   HighQ  HighQN    MedQ  MedQN    LowQ  LowQN       date
0     Alabama  339.06    1042  198.64    933  149.49    123 2014-01-01
1      Alaska  288.75     252  260.60    297  388.58     26 2014-01-01
2     Arizona  303.31    1941  209.35   1625  189.45    222 2014-01-01
3    Arkansas  361.85     576  185.62    544  125.87    112 2014-01-01
4  California  248.78   12096  193.56  12812  192.92    778 2014-01-01

In [5]:
price.tail()

               State   HighQ  HighQN    MedQ  MedQN  LowQ  LowQN       date
22894       Virginia  364.98    3513  293.12   3079   NaN    284 2014-12-31
22895     Washington  233.05    3337  189.92   3562   NaN    160 2014-12-31
22896  West Virginia  359.35     551  224.03    545   NaN     60 2014-12-31
22897      Wisconsin  350.52    2244  272.71   2221   NaN    167 2014-12-31
22898        Wyoming  322.27     131  351.86    197   NaN     12 2014-12-31

In [6]:
demographics.head()

,region,total_population,percent_white,percent_black,percent_asian,percent_hispanic,per_capita_income,median_rent,median_age
0,alabama,4799277,67,26,1,4,23680,501,38.1
1,alaska,720316,63,3,5,6,32651,978,33.6
2,arizona,6479703,57,4,3,30,25358,747,36.3
3,arkansas,2933369,74,15,1,7,22170,480,37.5
4,california,37659181,40,6,13,38,29527,1119,35.4

In [7]:
demographics.tail()

,region,total_population,percent_white,percent_black,percent_asian,percent_hispanic,per_capita_income,median_rent,median_age
46,virginia,8100653,64,19,6,8,33493,910,37.5
47,washington,6819579,72,3,7,11,30742,853,37.3
48,west virginia,1853619,93,3,1,1,22966,448,41.5
49,wisconsin,5706871,83,6,2,6,27523,636,38.7
50,wyoming,570134,85,1,1,9,28902,647,36.8

In [8]:
population.head()

       region     value
0     alabama   4777326
1      alaska    711139
2     arizona   6410979
3    arkansas   2916372
4  california  37325068

In [9]:
population.tail()

           region    value
46       virginia  8014955
47     washington  6738714
48  west virginia  1850481
49      wisconsin  5687219
50        wyoming   562803

In [12]:
price.dtypes

State             object
HighQ            float64
HighQN             int64
MedQ             float64
MedQN              int64
LowQ             float64
LowQN              int64
date      datetime64[ns]
dtype: object

In [16]:
#Sort the data by state and date
price.sort_values(by = ['State', 'date'], inplace=True)

#Fill in the missing values
price.fillna(method='ffill', inplace=True)

In [21]:
#Find the mean of California

california = price[price.State == "California"].copy(True)
california.head()

            State   HighQ  HighQN    MedQ  MedQN    LowQ  LowQN       date
20098  California  248.77   12021  193.44  12724  193.88    770 2013-12-27
20863  California  248.74   12025  193.44  12728  193.88    770 2013-12-28
21577  California  248.76   12047  193.55  12760  193.60    772 2013-12-29
22291  California  248.82   12065  193.54  12779  193.80    773 2013-12-30
22801  California  248.76   12082  193.54  12792  193.80    773 2013-12-31

In [22]:
ca_sum = california['HighQ'].sum()

In [23]:
ca_count = california['HighQ'].count()

In [26]:
ca_mean = ca_sum / ca_count
print("Average marijuana price in California is:", ca_mean)

Average marijuana price in California is: 245.37612472160356

In [28]:
#Find the CA mean for 2013, 2014, and 2015 individually:
#Code from ljsauer

def ca_mean_by_year(year):
    df = california[california['date'].dt.year == year]
    df_sum = df['HighQ'].sum()
    df_count = df['HighQ'].count()
    df_mean = df_sum / df_count
    return df_mean

In [29]:
ca_mean_by_year(2013)

248.76999999999998

In [30]:
ca_mean_by_year(2014)

245.89423076923077

In [31]:
ca_mean_by_year(2015)

242.806625

In [34]:
#Find the median (middle)

ca_count

449

In [36]:
#If the count is odd, the median is the value at (n+1)/2,
#else it is the average of n/2 and (n+1)/2

ca_highq = california.sort_values(by =['HighQ'])
ca_highq.head()

            State   HighQ  HighQN    MedQ  MedQN   LowQ  LowQN       date
19027  California  241.84   18419  187.90  21965  188.6   1229 2015-05-26
19741  California  241.85   18450  187.90  21993  188.6   1231 2015-05-27
8011   California  241.87   18066  188.86  21561  188.6   1212 2015-05-11
8827   California  241.87   18073  188.89  21584  188.6   1213 2015-05-12
18313  California  241.88   18398  187.85  21949  188.6   1228 2015-05-25

In [42]:
ca_median = ca_highq.HighQ.iloc[(ca_count) // 2]
print("The median price of marijuana in California is:", ca_median)

The median price of marijuana in California is: 245.31

In [ ]:
#Find the mode (most)

In [43]:
ca_mode = ca_highq.HighQ.value_counts().index[0]
print("The most common price of marijuana in California is:", ca_mode)

The most common price in California is: 245.05

In [45]:
#Find the variance (the range over which one measure (or variable) varies)
california["HighQ_dev"] = (california["HighQ"] - ca_mean) ** 2

In [47]:
ca_HighQ_variance = california.HighQ_dev.sum() / (ca_count - 1)
print("The variance of high quality marijuana prices in California is:", ca_HighQ_variance)

The variance of High Quality weed prices in California is: 2.982686287981228

In [48]:
#Find the standard deviation (the square root of variance)
ca_HighQ_SD = np.sqrt(ca_HighQ_variance)
print("The standard deviation of high quality marijuana prices in California is:", ca_HighQ_SD)

The standard deviation of high quality marijuana prices in California is: 1.727045537321245

In [49]:
california.describe()

,HighQ,HighQN,MedQ,MedQN,LowQ,LowQN,HighQ_dev
count,449.000000,449.000000,449.000000,449.000000,449.000000,449.000000,449.000000
mean,245.376125,14947.073497,191.268909,16769.821826,189.783586,976.298441,2.976043
std,1.727046,1656.133565,1.524028,2433.943191,1.598252,120.246714,3.961134
min,241.840000,12021.000000,187.850000,12724.000000,187.830000,770.000000,0.000015
25%,244.480000,13610.000000,190.260000,14826.000000,188.600000,878.000000,0.106357
50%,245.310000,15037.000000,191.570000,16793.000000,188.600000,982.000000,0.729103
75%,246.220000,16090.000000,192.550000,18435.000000,191.320000,1060.000000,4.435761
max,248.820000,18492.000000,193.630000,22027.000000,193.880000,1232.000000,12.504178

In [50]:
california.HighQ.mode()

0    245.03
1    245.05
dtype: float64

In [59]:
#Find the co-variance of price in California vs New York (a measure of how much two variables change together. )
NY = price[price["State"] == "New York"].copy(True)
NY.head()

          State   HighQ  HighQN    MedQ  MedQN    LowQ  LowQN       date
20120  New York  351.98    5773  268.83   5786  190.31    479 2013-12-27
20885  New York  351.92    5775  268.83   5786  190.31    479 2013-12-28
21599  New York  351.99    5785  269.02   5806  190.75    480 2013-12-29
22313  New York  352.02    5791  268.98   5814  190.75    480 2013-12-30
22823  New York  351.97    5794  268.93   5818  190.75    480 2013-12-31

In [60]:
NY = NY.loc[:, ["HighQ", "date"]]

#Rename the columns so we can differentiate from California's data
NY.columns = ["NY_HighQ", "date"]

In [61]:
NY.head()

       NY_HighQ       date
20120    351.98 2013-12-27
20885    351.92 2013-12-28
21599    351.99 2013-12-29
22313    352.02 2013-12-30
22823    351.97 2013-12-31

In [77]:
#Merge the two
CA_NY = pd.merge(california.loc[:, ["HighQ", "date"]].copy(), NY, on="date")
CA_NY.rename(columns={"HighQ": "ca_highq"}, inplace=True)
CA_NY.head()

   ca_highq       date  NY_HighQ
0    248.77 2013-12-27    351.98
1    248.74 2013-12-28    351.92
2    248.76 2013-12-29    351.99
3    248.82 2013-12-30    352.02
4    248.76 2013-12-31    351.97

In [78]:
#Find the mean for prices in New York
NY_mean = CA_NY.NY_HighQ.mean()
print(NY_mean)

346.9127616926502

In [88]:
#Since we got the California and New York mean, we are now ready to find the indiviual variances
CA_NY["ca_dev"] = CA_NY["ca_highq"] - ca_mean
CA_NY["ny_dev"] = CA_NY["NY_HighQ"] - NY_mean
CA_NY.head()

   ca_highq       date  NY_HighQ    ca_dev    ny_dev
0    248.77 2013-12-27    351.98  3.393875  5.067238
1    248.74 2013-12-28    351.92  3.363875  5.007238
2    248.76 2013-12-29    351.99  3.383875  5.077238
3    248.82 2013-12-30    352.02  3.443875  5.107238
4    248.76 2013-12-31    351.97  3.383875  5.057238

In [90]:
#Compute the Co-variance
CA_NY_cov = (CA_NY["ca_dev"] * CA_NY["ny_dev"]).sum() / (ca_count -1)
print("The covariance of high quaity marijuana prices between California and New York is:", 
     CA_NY_cov)

The covariance of high quaity marijuana prices between California and New York is: 5.91681496728842

In [93]:
#Find the correlation betwee prices in California and New York
CA_highq_std = CA_NY.ca_highq.std()
NY_HighQ_std = CA_NY.NY_HighQ.std()
CA_NY_corr = CA_NY_cov / (CA_highq_std * NY_HighQ_std)
print("The correlation between Marijuana prices in Caifornia and New York is:", CA_NY_corr)

The correlation between Marijuana prices in Caifornia and New York is: 0.9790439611064712